In [28]:
import pandas as pd

df = pd.read_csv("outlier_ornek_veriseti.csv",sep=";")
df

      isim  boy
0      can   88
1      ali  132
2    tugce  134
3     ayse  137
4    nihan  139
5    sahin  142
6     kaan  142
7     emre  144
8    bartu  147
9   ismail  148
10  gokalp  149
11   osman  149
12   filiz  150
13    veli  207
14   ilker  234

In [29]:
#Ortalama istatiksel verileri görmemizi sağlar
df.describe()

              boy
count   15.000000
mean   149.466667
std     32.943386
min     88.000000
25%    138.000000
50%    144.000000
75%    149.000000
max    234.000000

## Q1 (%25 percentile hesaplama)

In [30]:
Q1 = df.boy.quantile(0.25)
Q1

138.0

## Q3 (%75 percentile hesaplama)

In [31]:
Q3 = df.boy.quantile(0.75)
Q3

149.0

In [32]:
#Median
Q2 = df.boy.quantile(0.50)
Q2

144.0

In [33]:
## IQR deger hesaplama
IQR_degeri = Q3 - Q1
IQR_degeri

11.0

## Alt Limit Ve Üst Limit Hesaplama

In [34]:
alt_Limit = Q1 - 1.5 * IQR_degeri

In [35]:
alt_Limit

121.5

In [36]:
ust_Limit = Q3 + 1.5 * IQR_degeri

In [37]:
ust_Limit

165.5

## Alt ve Üst Limitleri Hesapladığımıza Göre Verisetimizdeki Outlier (Aykırı) Değerleri Bulabiliriz:

In [38]:
df[(df.boy < alt_Limit) | (df.boy > ust_Limit)]

     isim  boy
0     can   88
13   veli  207
14  ilker  234

### Bu değerler Outlier değerleridir. İstatiksel hesaplamalarımızın (ve tabiki bir çok yapay zeka algoritmasının) daha verimli ve etkin çalışabilmesi ve doğru sonuçlar üretebilmesi için Outlier değerleri veri setimizden çıkaracağız...

## Outlier değerlerin verisetimizden çıkarılması

In [39]:
df_filtred = df[(df.boy > alt_Limit) & (df.boy < ust_Limit)]

In [40]:
df_filtred

      isim  boy
1      ali  132
2    tugce  134
3     ayse  137
4    nihan  139
5    sahin  142
6     kaan  142
7     emre  144
8    bartu  147
9   ismail  148
10  gokalp  149
11   osman  149
12   filiz  150